In [1]:
import requests
from bs4 import BeautifulSoup as bs
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [3]:
url ='https://en.wikipedia.org/wiki/List_of_Michelin_3-star_restaurants'
html=requests.get(url).text
sopa=bs(html, 'html.parser')

In [5]:
tabla=sopa.find_all('table', class_='wikitable sortable')[0]
tbody=tabla.find('tbody')
registros=tbody.find_all('tr')[1]
datos=registros.find_all('td')
#registros.text

In [7]:
colum_names=['location','restaurant','chef','awarded_year']
df_restaurants=pd.DataFrame(columns=colum_names)


tablas=sopa.find_all('table', class_='wikitable sortable')

for tabla in tablas:
   
    tbody=tabla.find('tbody')
    filas=tbody.find_all('tr')
    
    for i in range(1,len(filas)-1):
        
        fila = filas[i]
        datos=fila.find_all('td')    
        registro={'location': datos[0].text,'restaurant': datos[1].text,'chef': datos[2].text,
                  'awarded_year': datos[3].text.split('[')[0]}        
        df_restaurants=df_restaurants.append(registro, ignore_index=True)
    
df_restaurants.head()

      location     restaurant                      chef awarded_year
0  Kruishoutem  Hof van Cleve            Peter Goossens         2005
1    Antwerp\n        Zilte\n             Viki Geunes\n         2021
2      Beijing    Xin Rong Ji  Zhang Yong (Founder)[27]         2020
3    Beijing\n   King's Joy\n                Gary Yin\n         2021
4   Copenhagen       Geranium             Rasmus Kofoed         2016

In [12]:
url ='https://www.numbeo.com/cost-of-living/country_price_rankings?itemId=105&displayCurrency=EUR'
html=requests.get(url).text
sopa=bs(html, 'html.parser')

In [59]:
container=sopa.find_all('div', id='page_container')[0]
tabla=container.find('table')
filas=tabla.find_all('tr')

colum_names=['country','net_salary']
df_salarys=pd.DataFrame(columns=colum_names)

for fila in filas:
    
    columnas=fila.find_all('td')
    registro={'country': columnas[1].text.replace('\n',''),'net_salary': columnas[3].text.replace('\n','')}        
    df_salarys=df_salarys.append(registro, ignore_index=True)
    
df_salarys

                  country  net_salary
0             Switzerland  5,931.31 €
1               Singapore  4,357.25 €
2               Australia  4,092.05 €
3    United Arab Emirates  3,799.26 €
4           United States  3,755.31 €
..                    ...         ...
101                 Nepal    197.47 €
102             Venezuela    187.08 €
103               Nigeria    167.98 €
104              Pakistan    161.83 €
105             Sri Lanka    148.60 €

[106 rows x 2 columns]